name: "prithvi_pluvial"
backend: "python"
max_batch_size: 0

input [
  {
    name: "request"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "result"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

instance_group [{ kind: KIND_GPU, count: 1 }]
